<template>
<div class="container-OECalc">
    <div>
        <!-- 인형병종 선택 (5 분리시켜서 따로 선택&계산) -->
    </div>
    <div>
        <!-- 입력받아야 할 값
        링크수, 장탄수(MG, SG 한정), 화력, 철갑, 치명률, 치명상, 사속, 명중
        체력, 회피, 별 수, 스킬렙 -->
    </div>
    <div>
        <!-- 최종 작능 표시 (내부적으로 공격부, 방어부, 스킬부 나눠서 계산) -->
    </div>
<!-- 공격부

엠지
7*링크수*(장탄수*(화력+철갑/3)*(치명타*치명상+1)/(장탄수/3+4+200/사속)*명중/(명중+23)+8)

샷건
=6*링크수*(3*장탄수*(화력+철갑/3)*(치명타*치명상+1)/(1.5+장탄수*50/사속+0.5*장탄수)*명중/(명중+23)+8)

일반 병종(샷건 엠지 제외한 모든 병종)
5*링크수*((화력+철갑/3)*(치명타*치명상+1)*사속/50*명중/(명중+23)+8)

* 해당값을 올림 한게 공격부
* 치명상 150퍼센트면 0.5 180퍼센트면 0.8
* 치명타 20퍼면 0.2 88이면 0.88





방어부

체력*링크수*(35+회피)/35*(2.6*75/MAX(1,75-장갑)-1.6)

* 해당값을 올림 한게 방어부
* 체력은 총체력 / 링크수 한 값 5링 1200이면 체력 부는 240
* MAX() 는 샷건의 장갑이 너무 높아졌을 때 위한 장치 샷건 장갑이 75 밑이라고 가정한다면
체력*링크수*(35+회피)/35*(2.6*75/(75-장갑)-1.6)




스킬부

=링크수*(0.8+별수/10)*(35+(5*(스킬렙-1)))

* 해당값을 올림 한게 스킬부
* 별수는 말그대로 2,3,4,5성 의 그 숫자임 엑스트라는 5 -->
</div>
</template>

<script>
export default {
  
}
</script>

<style>
  
</style>